garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0062h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_CLKRMD_POSN                         equ 0001h
PMD0_CLKRMD_POSITION                     equ 0001h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0002h
PMD0_SCANMD_POSN                         equ 0003h
PMD0_SCANMD_POSITION                     equ 0003h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0008h
PMD0_CRCMD_POSN                          equ 0004h
PMD0_CRCMD_POSITION                      equ 0004h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0010h
PMD0_HLVDMD_POSN                         equ 0005h
PMD0_HLVDMD_POSITION                     equ 0005h
PMD0_HLVDMD_SIZE                         equ 0001h
PMD0_HLVDMD_LENGTH                       equ 0001h
PMD0_HLVDMD_MASK                         equ 0020h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h
PMD0_LVDMD_POSN                          equ 0005h
PMD0_LVDMD_POSITION                      equ 0005h
PMD0_LVDMD_SIZE                          equ 0001h
PMD0_LVDMD_LENGTH                        equ 0001h
PMD0_LVDMD_MASK                          equ 0020h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0063h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_APMMD_POSN                          equ 0005h
PMD1_APMMD_POSITION                      equ 0005h
PMD1_APMMD_SIZE                          equ 0001h
PMD1_APMMD_LENGTH                        equ 0001h
PMD1_APMMD_MASK                          equ 0020h
PMD1_ZCDMD_POSN                          equ 0006h
PMD1_ZCDMD_POSITION                      equ 0006h
PMD1_ZCDMD_SIZE                          equ 0001h
PMD1_ZCDMD_LENGTH                        equ 0001h
PMD1_ZCDMD_MASK                          equ 0040h
PMD1_CM1MD_POSN                          equ 0007h
PMD1_CM1MD_POSITION                      equ 0007h
PMD1_CM1MD_SIZE                          equ 0001h
PMD1_CM1MD_LENGTH                        equ 0001h
PMD1_CM1MD_MASK                          equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0064h
// bitfield definitions
PMD2_CM2MD_POSN                          equ 0000h
PMD2_CM2MD_POSITION                      equ 0000h
PMD2_CM2MD_SIZE                          equ 0001h
PMD2_CM2MD_LENGTH                        equ 0001h
PMD2_CM2MD_MASK                          equ 0001h
PMD2_ADCMD_POSN                          equ 0001h
PMD2_ADCMD_POSITION                      equ 0001h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0002h
PMD2_DAC1MD_POSN                         equ 0002h
PMD2_DAC1MD_POSITION                     equ 0002h
PMD2_DAC1MD_SIZE                         equ 0001h
PMD2_DAC1MD_LENGTH                       equ 0001h
PMD2_DAC1MD_MASK                         equ 0004h
PMD2_ACTMD_POSN                          equ 0003h
PMD2_ACTMD_POSITION                      equ 0003h
PMD2_ACTMD_SIZE                          equ 0001h
PMD2_ACTMD_LENGTH                        equ 0001h
PMD2_ACTMD_MASK                          equ 0008h
PMD2_NCO1MD_POSN                         equ 0004h
PMD2_NCO1MD_POSITION                     equ 0004h
PMD2_NCO1MD_SIZE                         equ 0001h
PMD2_NCO1MD_LENGTH                       equ 0001h
PMD2_NCO1MD_MASK                         equ 0010h
PMD2_CWG1MD_POSN                         equ 0006h
PMD2_CWG1MD_POSITION                     equ 0006h
PMD2_CWG1MD_SIZE                         equ 0001h
PMD2_CWG1MD_LENGTH                       equ 0001h
PMD2_CWG1MD_MASK                         equ 0040h
PMD2_CCP1MD_POSN                         equ 0007h
PMD2_CCP1MD_POSITION                     equ 0007h
PMD2_CCP1MD_SIZE                         equ 0001h
PMD2_CCP1MD_LENGTH                       equ 0001h
PMD2_CCP1MD_MASK                         equ 0080h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0065h
// bitfield definitions
PMD3_PWM1MD_POSN                         equ 0000h
PMD3_PWM1MD_POSITION                     equ 0000h
PMD3_PWM1MD_SIZE                         equ 0001h
PMD3_PWM1MD_LENGTH                       equ 0001h
PMD3_PWM1MD_MASK                         equ 0001h
PMD3_PWM2MD_POSN                         equ 0001h
PMD3_PWM2MD_POSITION                     equ 0001h
PMD3_PWM2MD_SIZE                         equ 0001h
PMD3_PWM2MD_LENGTH                       equ 0001h
PMD3_PWM2MD_MASK                         equ 0002h
PMD3_PWM3MD_POSN                         equ 0002h
PMD3_PWM3MD_POSITION                     equ 0002h
PMD3_PWM3MD_SIZE                         equ 0001h
PMD3_PWM3MD_LENGTH                       equ 0001h
PMD3_PWM3MD_MASK                         equ 0004h
PMD3_I2C1MD_POSN                         equ 0003h
PMD3_I2C1MD_POSITION                     equ 0003h
PMD3_I2C1MD_SIZE                         equ 0001h
PMD3_I2C1MD_LENGTH                       equ 0001h
PMD3_I2C1MD_MASK                         equ 0008h
PMD3_SPI1MD_POSN                         equ 0004h
PMD3_SPI1MD_POSITION                     equ 0004h
PMD3_SPI1MD_SIZE                         equ 0001h
PMD3_SPI1MD_LENGTH                       equ 0001h
PMD3_SPI1MD_MASK                         equ 0010h
PMD3_U1MD_POSN                           equ 0006h
PMD3_U1MD_POSITION                       equ 0006h
PMD3_U1MD_SIZE                           equ 0001h
PMD3_U1MD_LENGTH                         equ 0001h
PMD3_U1MD_MASK                           equ 0040h
PMD3_U2MD_POSN                           equ 0007h
PMD3_U2MD_POSITION                       equ 0007h
PMD3_U2MD_SIZE                           equ 0001h
PMD3_U2MD_LENGTH                         equ 0001h
PMD3_U2MD_MASK                           equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0066h
// bitfield definitions
PMD4_CLC1MD_POSN                         equ 0001h
PMD4_CLC1MD_POSITION                     equ 0001h
PMD4_CLC1MD_SIZE                         equ 0001h
PMD4_CLC1MD_LENGTH                       equ 0001h
PMD4_CLC1MD_MASK                         equ 0002h
PMD4_CLC2MD_POSN                         equ 0002h
PMD4_CLC2MD_POSITION                     equ 0002h
PMD4_CLC2MD_SIZE                         equ 0001h
PMD4_CLC2MD_LENGTH                       equ 0001h
PMD4_CLC2MD_MASK                         equ 0004h
PMD4_CLC3MD_POSN                         equ 0003h
PMD4_CLC3MD_POSITION                     equ 0003h
PMD4_CLC3MD_SIZE                         equ 0001h
PMD4_CLC3MD_LENGTH                       equ 0001h
PMD4_CLC3MD_MASK                         equ 0008h
PMD4_CLC4MD_POSN                         equ 0004h
PMD4_CLC4MD_POSITION                     equ 0004h
PMD4_CLC4MD_SIZE                         equ 0001h
PMD4_CLC4MD_LENGTH                       equ 0001h
PMD4_CLC4MD_MASK                         equ 0010h
PMD4_DMA1MD_POSN                         equ 0005h
PMD4_DMA1MD_POSITION                     equ 0005h
PMD4_DMA1MD_SIZE                         equ 0001h
PMD4_DMA1MD_LENGTH                       equ 0001h
PMD4_DMA1MD_MASK                         equ 0020h
PMD4_DMA2MD_POSN                         equ 0006h
PMD4_DMA2MD_POSITION                     equ 0006h
PMD4_DMA2MD_SIZE                         equ 0001h
PMD4_DMA2MD_LENGTH                       equ 0001h
PMD4_DMA2MD_MASK                         equ 0040h
PMD4_DMA3MD_POSN                         equ 0007h
PMD4_DMA3MD_POSITION                     equ 0007h
PMD4_DMA3MD_SIZE                         equ 0001h
PMD4_DMA3MD_LENGTH                       equ 0001h
PMD4_DMA3MD_MASK                         equ 0080h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0067h
// bitfield definitions
PMD5_DMA4MD_POSN                         equ 0000h
PMD5_DMA4MD_POSITION                     equ 0000h
PMD5_DMA4MD_SIZE                         equ 0001h
PMD5_DMA4MD_LENGTH                       equ 0001h
PMD5_DMA4MD_MASK                         equ 0001h
PMD5_DAC2MD_POSN                         equ 0001h
PMD5_DAC2MD_POSITION                     equ 0001h
PMD5_DAC2MD_SIZE                         equ 0001h
PMD5_DAC2MD_LENGTH                       equ 0001h
PMD5_DAC2MD_MASK                         equ 0002h
PMD5_OPA1MD_POSN                         equ 0002h
PMD5_OPA1MD_POSITION                     equ 0002h
PMD5_OPA1MD_SIZE                         equ 0001h
PMD5_OPA1MD_LENGTH                       equ 0001h
PMD5_OPA1MD_MASK                         equ 0004h
PMD5_OPA2MD_POSN                         equ 0003h
PMD5_OPA2MD_POSITION                     equ 0003h
PMD5_OPA2MD_SIZE                         equ 0001h
PMD5_OPA2MD_LENGTH                       equ 0001h
PMD5_OPA2MD_MASK                         equ 0008h
PMD5_CLC5MD_POSN                         equ 0004h
PMD5_CLC5MD_POSITION                     equ 0004h
PMD5_CLC5MD_SIZE                         equ 0001h
PMD5_CLC5MD_LENGTH                       equ 0001h
PMD5_CLC5MD_MASK                         equ 0010h
PMD5_CLC6MD_POSN                         equ 0005h
PMD5_CLC6MD_POSITION                     equ 0005h
PMD5_CLC6MD_SIZE                         equ 0001h
PMD5_CLC6MD_LENGTH                       equ 0001h
PMD5_CLC6MD_MASK                         equ 0020h
PMD5_CLC7MD_POSN                         equ 0006h
PMD5_CLC7MD_POSITION                     equ 0006h
PMD5_CLC7MD_SIZE                         equ 0001h
PMD5_CLC7MD_LENGTH                       equ 0001h
PMD5_CLC7MD_MASK                         equ 0040h
PMD5_CLC8MD_POSN                         equ 0007h
PMD5_CLC8MD_POSITION                     equ 0007h
PMD5_CLC8MD_SIZE                         equ 0001h
PMD5_CLC8MD_LENGTH                       equ 0001h
PMD5_CLC8MD_MASK                         equ 0080h

// Register: PMD6
#define PMD6 PMD6
PMD6                                     equ 0068h
// bitfield definitions
PMD6_TU16AMD_POSN                        equ 0000h
PMD6_TU16AMD_POSITION                    equ 0000h
PMD6_TU16AMD_SIZE                        equ 0001h
PMD6_TU16AMD_LENGTH                      equ 0001h
PMD6_TU16AMD_MASK                        equ 0001h
PMD6_TU16BMD_POSN                        equ 0001h
PMD6_TU16BMD_POSITION                    equ 0001h
PMD6_TU16BMD_SIZE                        equ 0001h
PMD6_TU16BMD_LENGTH                      equ 0001h
PMD6_TU16BMD_MASK                        equ 0002h
PMD6_DAC3MD_POSN                         equ 0002h
PMD6_DAC3MD_POSITION                     equ 0002h
PMD6_DAC3MD_SIZE                         equ 0001h
PMD6_DAC3MD_LENGTH                       equ 0001h
PMD6_DAC3MD_MASK                         equ 0004h
PMD6_PORTWMD_POSN                        equ 0003h
PMD6_PORTWMD_POSITION                    equ 0003h
PMD6_PORTWMD_SIZE                        equ 0001h
PMD6_PORTWMD_LENGTH                      equ 0001h
PMD6_PORTWMD_MASK                        equ 0008h
PMD6_CCP2MD_POSN                         equ 0007h
PMD6_CCP2MD_POSITION                     equ 0007h
PMD6_CCP2MD_SIZE                         equ 0001h
PMD6_CCP2MD_LENGTH                       equ 0001h
PMD6_CCP2MD_MASK                         equ 0080h
PMD6_TU1MD_POSN                          equ 0000h
PMD6_TU1MD_POSITION                      equ 0000h
PMD6_TU1MD_SIZE                          equ 0001h
PMD6_TU1MD_LENGTH                        equ 0001h
PMD6_TU1MD_MASK                          equ 0001h
PMD6_TU2MD_POSN                          equ 0001h
PMD6_TU2MD_POSITION                      equ 0001h
PMD6_TU2MD_SIZE                          equ 0001h
PMD6_TU2MD_LENGTH                        equ 0001h
PMD6_TU2MD_MASK                          equ 0002h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 006Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0070h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0002h
CM1CON0_HYS_LENGTH                       equ 0002h
CM1CON0_HYS_MASK                         equ 0006h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OE_POSN                          equ 0005h
CM1CON0_OE_POSITION                      equ 0005h
CM1CON0_OE_SIZE                          equ 0001h
CM1CON0_OE_LENGTH                        equ 0001h
CM1CON0_OE_MASK                          equ 0020h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_EN_POSN                          equ 0007h
CM1CON0_EN_POSITION                      equ 0007h
CM1CON0_EN_SIZE                          equ 0001h
CM1CON0_EN_LENGTH                        equ 0001h
CM1CON0_EN_MASK                          equ 0080h
CM1CON0_HYS0_POSN                        equ 0001h
CM1CON0_HYS0_POSITION                    equ 0001h
CM1CON0_HYS0_SIZE                        equ 0001h
CM1CON0_HYS0_LENGTH                      equ 0001h
CM1CON0_HYS0_MASK                        equ 0002h
CM1CON0_HYS1_POSN                        equ 0002h
CM1CON0_HYS1_POSITION                    equ 0002h
CM1CON0_HYS1_SIZE                        equ 0001h
CM1CON0_HYS1_LENGTH                      equ 0001h
CM1CON0_HYS1_MASK                        equ 0004h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1HYS1_POSN                      equ 0002h
CM1CON0_C1HYS1_POSITION                  equ 0002h
CM1CON0_C1HYS1_SIZE                      equ 0001h
CM1CON0_C1HYS1_LENGTH                    equ 0001h
CM1CON0_C1HYS1_MASK                      equ 0004h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OE_POSN                        equ 0005h
CM1CON0_C1OE_POSITION                    equ 0005h
CM1CON0_C1OE_SIZE                        equ 0001h
CM1CON0_C1OE_LENGTH                      equ 0001h
CM1CON0_C1OE_MASK                        equ 0020h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1EN_POSN                        equ 0007h
CM1CON0_C1EN_POSITION                    equ 0007h
CM1CON0_C1EN_SIZE                        equ 0001h
CM1CON0_C1EN_LENGTH                      equ 0001h
CM1CON0_C1EN_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0071h
// bitfield definitions
CM1CON1_INTN_POSN                        equ 0000h
CM1CON1_INTN_POSITION                    equ 0000h
CM1CON1_INTN_SIZE                        equ 0001h
CM1CON1_INTN_LENGTH                      equ 0001h
CM1CON1_INTN_MASK                        equ 0001h
CM1CON1_INTP_POSN                        equ 0001h
CM1CON1_INTP_POSITION                    equ 0001h
CM1CON1_INTP_SIZE                        equ 0001h
CM1CON1_INTP_LENGTH                      equ 0001h
CM1CON1_INTP_MASK                        equ 0002h
CM1CON1_SP_POSN                          equ 0002h
CM1CON1_SP_POSITION                      equ 0002h
CM1CON1_SP_SIZE                          equ 0002h
CM1CON1_SP_LENGTH                        equ 0002h
CM1CON1_SP_MASK                          equ 000Ch
CM1CON1_RDY_POSN                         equ 0007h
CM1CON1_RDY_POSITION                     equ 0007h
CM1CON1_RDY_SIZE                         equ 0001h
CM1CON1_RDY_LENGTH                       equ 0001h
CM1CON1_RDY_MASK                         equ 0080h
CM1CON1_SP0_POSN                         equ 0002h
CM1CON1_SP0_POSITION                     equ 0002h
CM1CON1_SP0_SIZE                         equ 0001h
CM1CON1_SP0_LENGTH                       equ 0001h
CM1CON1_SP0_MASK                         equ 0004h
CM1CON1_SP1_POSN                         equ 0003h
CM1CON1_SP1_POSITION                     equ 0003h
CM1CON1_SP1_SIZE                         equ 0001h
CM1CON1_SP1_LENGTH                       equ 0001h
CM1CON1_SP1_MASK                         equ 0008h
CM1CON1_C1INTN_POSN                      equ 0000h
CM1CON1_C1INTN_POSITION                  equ 0000h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0001h
CM1CON1_C1INTP_POSN                      equ 0001h
CM1CON1_C1INTP_POSITION                  equ 0001h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0002h
CM1CON1_C1SP0_POSN                       equ 0002h
CM1CON1_C1SP0_POSITION                   equ 0002h
CM1CON1_C1SP0_SIZE                       equ 0001h
CM1CON1_C1SP0_LENGTH                     equ 0001h
CM1CON1_C1SP0_MASK                       equ 0004h
CM1CON1_C1SP1_POSN                       equ 0003h
CM1CON1_C1SP1_POSITION                   equ 0003h
CM1CON1_C1SP1_SIZE                       equ 0001h
CM1CON1_C1SP1_LENGTH                     equ 0001h
CM1CON1_C1SP1_MASK                       equ 0008h
CM1CON1_C1RDY_POSN                       equ 0007h
CM1CON1_C1RDY_POSITION                   equ 0007h
CM1CON1_C1RDY_SIZE                       equ 0001h
CM1CON1_C1RDY_LENGTH                     equ 0001h
CM1CON1_C1RDY_MASK                       equ 0080h

