garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.inc
// Register: RF3PPS
#define RF3PPS RF3PPS
RF3PPS                                   equ 0228h
// bitfield definitions
RF3PPS_RF3PPS0_POSN                      equ 0000h
RF3PPS_RF3PPS0_POSITION                  equ 0000h
RF3PPS_RF3PPS0_SIZE                      equ 0001h
RF3PPS_RF3PPS0_LENGTH                    equ 0001h
RF3PPS_RF3PPS0_MASK                      equ 0001h
RF3PPS_RF3PPS1_POSN                      equ 0001h
RF3PPS_RF3PPS1_POSITION                  equ 0001h
RF3PPS_RF3PPS1_SIZE                      equ 0001h
RF3PPS_RF3PPS1_LENGTH                    equ 0001h
RF3PPS_RF3PPS1_MASK                      equ 0002h
RF3PPS_RF3PPS2_POSN                      equ 0002h
RF3PPS_RF3PPS2_POSITION                  equ 0002h
RF3PPS_RF3PPS2_SIZE                      equ 0001h
RF3PPS_RF3PPS2_LENGTH                    equ 0001h
RF3PPS_RF3PPS2_MASK                      equ 0004h
RF3PPS_RF3PPS3_POSN                      equ 0003h
RF3PPS_RF3PPS3_POSITION                  equ 0003h
RF3PPS_RF3PPS3_SIZE                      equ 0001h
RF3PPS_RF3PPS3_LENGTH                    equ 0001h
RF3PPS_RF3PPS3_MASK                      equ 0008h
RF3PPS_RF3PPS4_POSN                      equ 0004h
RF3PPS_RF3PPS4_POSITION                  equ 0004h
RF3PPS_RF3PPS4_SIZE                      equ 0001h
RF3PPS_RF3PPS4_LENGTH                    equ 0001h
RF3PPS_RF3PPS4_MASK                      equ 0010h
RF3PPS_RF3PPS5_POSN                      equ 0005h
RF3PPS_RF3PPS5_POSITION                  equ 0005h
RF3PPS_RF3PPS5_SIZE                      equ 0001h
RF3PPS_RF3PPS5_LENGTH                    equ 0001h
RF3PPS_RF3PPS5_MASK                      equ 0020h

// Register: RF4PPS
#define RF4PPS RF4PPS
RF4PPS                                   equ 0229h
// bitfield definitions
RF4PPS_RF4PPS0_POSN                      equ 0000h
RF4PPS_RF4PPS0_POSITION                  equ 0000h
RF4PPS_RF4PPS0_SIZE                      equ 0001h
RF4PPS_RF4PPS0_LENGTH                    equ 0001h
RF4PPS_RF4PPS0_MASK                      equ 0001h
RF4PPS_RF4PPS1_POSN                      equ 0001h
RF4PPS_RF4PPS1_POSITION                  equ 0001h
RF4PPS_RF4PPS1_SIZE                      equ 0001h
RF4PPS_RF4PPS1_LENGTH                    equ 0001h
RF4PPS_RF4PPS1_MASK                      equ 0002h
RF4PPS_RF4PPS2_POSN                      equ 0002h
RF4PPS_RF4PPS2_POSITION                  equ 0002h
RF4PPS_RF4PPS2_SIZE                      equ 0001h
RF4PPS_RF4PPS2_LENGTH                    equ 0001h
RF4PPS_RF4PPS2_MASK                      equ 0004h
RF4PPS_RF4PPS3_POSN                      equ 0003h
RF4PPS_RF4PPS3_POSITION                  equ 0003h
RF4PPS_RF4PPS3_SIZE                      equ 0001h
RF4PPS_RF4PPS3_LENGTH                    equ 0001h
RF4PPS_RF4PPS3_MASK                      equ 0008h
RF4PPS_RF4PPS4_POSN                      equ 0004h
RF4PPS_RF4PPS4_POSITION                  equ 0004h
RF4PPS_RF4PPS4_SIZE                      equ 0001h
RF4PPS_RF4PPS4_LENGTH                    equ 0001h
RF4PPS_RF4PPS4_MASK                      equ 0010h
RF4PPS_RF4PPS5_POSN                      equ 0005h
RF4PPS_RF4PPS5_POSITION                  equ 0005h
RF4PPS_RF4PPS5_SIZE                      equ 0001h
RF4PPS_RF4PPS5_LENGTH                    equ 0001h
RF4PPS_RF4PPS5_MASK                      equ 0020h

// Register: RF5PPS
#define RF5PPS RF5PPS
RF5PPS                                   equ 022Ah
// bitfield definitions
RF5PPS_RF5PPS0_POSN                      equ 0000h
RF5PPS_RF5PPS0_POSITION                  equ 0000h
RF5PPS_RF5PPS0_SIZE                      equ 0001h
RF5PPS_RF5PPS0_LENGTH                    equ 0001h
RF5PPS_RF5PPS0_MASK                      equ 0001h
RF5PPS_RF5PPS1_POSN                      equ 0001h
RF5PPS_RF5PPS1_POSITION                  equ 0001h
RF5PPS_RF5PPS1_SIZE                      equ 0001h
RF5PPS_RF5PPS1_LENGTH                    equ 0001h
RF5PPS_RF5PPS1_MASK                      equ 0002h
RF5PPS_RF5PPS2_POSN                      equ 0002h
RF5PPS_RF5PPS2_POSITION                  equ 0002h
RF5PPS_RF5PPS2_SIZE                      equ 0001h
RF5PPS_RF5PPS2_LENGTH                    equ 0001h
RF5PPS_RF5PPS2_MASK                      equ 0004h
RF5PPS_RF5PPS3_POSN                      equ 0003h
RF5PPS_RF5PPS3_POSITION                  equ 0003h
RF5PPS_RF5PPS3_SIZE                      equ 0001h
RF5PPS_RF5PPS3_LENGTH                    equ 0001h
RF5PPS_RF5PPS3_MASK                      equ 0008h
RF5PPS_RF5PPS4_POSN                      equ 0004h
RF5PPS_RF5PPS4_POSITION                  equ 0004h
RF5PPS_RF5PPS4_SIZE                      equ 0001h
RF5PPS_RF5PPS4_LENGTH                    equ 0001h
RF5PPS_RF5PPS4_MASK                      equ 0010h
RF5PPS_RF5PPS5_POSN                      equ 0005h
RF5PPS_RF5PPS5_POSITION                  equ 0005h
RF5PPS_RF5PPS5_SIZE                      equ 0001h
RF5PPS_RF5PPS5_LENGTH                    equ 0001h
RF5PPS_RF5PPS5_MASK                      equ 0020h

// Register: RF6PPS
#define RF6PPS RF6PPS
RF6PPS                                   equ 022Bh
// bitfield definitions
RF6PPS_RF6PPS0_POSN                      equ 0000h
RF6PPS_RF6PPS0_POSITION                  equ 0000h
RF6PPS_RF6PPS0_SIZE                      equ 0001h
RF6PPS_RF6PPS0_LENGTH                    equ 0001h
RF6PPS_RF6PPS0_MASK                      equ 0001h
RF6PPS_RF6PPS1_POSN                      equ 0001h
RF6PPS_RF6PPS1_POSITION                  equ 0001h
RF6PPS_RF6PPS1_SIZE                      equ 0001h
RF6PPS_RF6PPS1_LENGTH                    equ 0001h
RF6PPS_RF6PPS1_MASK                      equ 0002h
RF6PPS_RF6PPS2_POSN                      equ 0002h
RF6PPS_RF6PPS2_POSITION                  equ 0002h
RF6PPS_RF6PPS2_SIZE                      equ 0001h
RF6PPS_RF6PPS2_LENGTH                    equ 0001h
RF6PPS_RF6PPS2_MASK                      equ 0004h
RF6PPS_RF6PPS3_POSN                      equ 0003h
RF6PPS_RF6PPS3_POSITION                  equ 0003h
RF6PPS_RF6PPS3_SIZE                      equ 0001h
RF6PPS_RF6PPS3_LENGTH                    equ 0001h
RF6PPS_RF6PPS3_MASK                      equ 0008h
RF6PPS_RF6PPS4_POSN                      equ 0004h
RF6PPS_RF6PPS4_POSITION                  equ 0004h
RF6PPS_RF6PPS4_SIZE                      equ 0001h
RF6PPS_RF6PPS4_LENGTH                    equ 0001h
RF6PPS_RF6PPS4_MASK                      equ 0010h
RF6PPS_RF6PPS5_POSN                      equ 0005h
RF6PPS_RF6PPS5_POSITION                  equ 0005h
RF6PPS_RF6PPS5_SIZE                      equ 0001h
RF6PPS_RF6PPS5_LENGTH                    equ 0001h
RF6PPS_RF6PPS5_MASK                      equ 0020h

// Register: RF7PPS
#define RF7PPS RF7PPS
RF7PPS                                   equ 022Ch
// bitfield definitions
RF7PPS_RF7PPS0_POSN                      equ 0000h
RF7PPS_RF7PPS0_POSITION                  equ 0000h
RF7PPS_RF7PPS0_SIZE                      equ 0001h
RF7PPS_RF7PPS0_LENGTH                    equ 0001h
RF7PPS_RF7PPS0_MASK                      equ 0001h
RF7PPS_RF7PPS1_POSN                      equ 0001h
RF7PPS_RF7PPS1_POSITION                  equ 0001h
RF7PPS_RF7PPS1_SIZE                      equ 0001h
RF7PPS_RF7PPS1_LENGTH                    equ 0001h
RF7PPS_RF7PPS1_MASK                      equ 0002h
RF7PPS_RF7PPS2_POSN                      equ 0002h
RF7PPS_RF7PPS2_POSITION                  equ 0002h
RF7PPS_RF7PPS2_SIZE                      equ 0001h
RF7PPS_RF7PPS2_LENGTH                    equ 0001h
RF7PPS_RF7PPS2_MASK                      equ 0004h
RF7PPS_RF7PPS3_POSN                      equ 0003h
RF7PPS_RF7PPS3_POSITION                  equ 0003h
RF7PPS_RF7PPS3_SIZE                      equ 0001h
RF7PPS_RF7PPS3_LENGTH                    equ 0001h
RF7PPS_RF7PPS3_MASK                      equ 0008h
RF7PPS_RF7PPS4_POSN                      equ 0004h
RF7PPS_RF7PPS4_POSITION                  equ 0004h
RF7PPS_RF7PPS4_SIZE                      equ 0001h
RF7PPS_RF7PPS4_LENGTH                    equ 0001h
RF7PPS_RF7PPS4_MASK                      equ 0010h
RF7PPS_RF7PPS5_POSN                      equ 0005h
RF7PPS_RF7PPS5_POSITION                  equ 0005h
RF7PPS_RF7PPS5_SIZE                      equ 0001h
RF7PPS_RF7PPS5_LENGTH                    equ 0001h
RF7PPS_RF7PPS5_MASK                      equ 0020h

