garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.inc
// Register: TU16BTMR
#define TU16BTMR TU16BTMR
TU16BTMR                                 equ 03AEh

// Register: TU16BTMRL
#define TU16BTMRL TU16BTMRL
TU16BTMRL                                equ 03AEh
// bitfield definitions
TU16BTMRL_TMRL_POSN                      equ 0000h
TU16BTMRL_TMRL_POSITION                  equ 0000h
TU16BTMRL_TMRL_SIZE                      equ 0008h
TU16BTMRL_TMRL_LENGTH                    equ 0008h
TU16BTMRL_TMRL_MASK                      equ 00FFh
TU16BTMRL_TMRL0_POSN                     equ 0000h
TU16BTMRL_TMRL0_POSITION                 equ 0000h
TU16BTMRL_TMRL0_SIZE                     equ 0001h
TU16BTMRL_TMRL0_LENGTH                   equ 0001h
TU16BTMRL_TMRL0_MASK                     equ 0001h
TU16BTMRL_TMRL1_POSN                     equ 0001h
TU16BTMRL_TMRL1_POSITION                 equ 0001h
TU16BTMRL_TMRL1_SIZE                     equ 0001h
TU16BTMRL_TMRL1_LENGTH                   equ 0001h
TU16BTMRL_TMRL1_MASK                     equ 0002h
TU16BTMRL_TMRL2_POSN                     equ 0002h
TU16BTMRL_TMRL2_POSITION                 equ 0002h
TU16BTMRL_TMRL2_SIZE                     equ 0001h
TU16BTMRL_TMRL2_LENGTH                   equ 0001h
TU16BTMRL_TMRL2_MASK                     equ 0004h
TU16BTMRL_TMRL3_POSN                     equ 0003h
TU16BTMRL_TMRL3_POSITION                 equ 0003h
TU16BTMRL_TMRL3_SIZE                     equ 0001h
TU16BTMRL_TMRL3_LENGTH                   equ 0001h
TU16BTMRL_TMRL3_MASK                     equ 0008h
TU16BTMRL_TMRL4_POSN                     equ 0004h
TU16BTMRL_TMRL4_POSITION                 equ 0004h
TU16BTMRL_TMRL4_SIZE                     equ 0001h
TU16BTMRL_TMRL4_LENGTH                   equ 0001h
TU16BTMRL_TMRL4_MASK                     equ 0010h
TU16BTMRL_TMRL5_POSN                     equ 0005h
TU16BTMRL_TMRL5_POSITION                 equ 0005h
TU16BTMRL_TMRL5_SIZE                     equ 0001h
TU16BTMRL_TMRL5_LENGTH                   equ 0001h
TU16BTMRL_TMRL5_MASK                     equ 0020h
TU16BTMRL_TMRL6_POSN                     equ 0006h
TU16BTMRL_TMRL6_POSITION                 equ 0006h
TU16BTMRL_TMRL6_SIZE                     equ 0001h
TU16BTMRL_TMRL6_LENGTH                   equ 0001h
TU16BTMRL_TMRL6_MASK                     equ 0040h
TU16BTMRL_TMRL7_POSN                     equ 0007h
TU16BTMRL_TMRL7_POSITION                 equ 0007h
TU16BTMRL_TMRL7_SIZE                     equ 0001h
TU16BTMRL_TMRL7_LENGTH                   equ 0001h
TU16BTMRL_TMRL7_MASK                     equ 0080h
TU16BTMRL_TU16BTMRL0_POSN                equ 0000h
TU16BTMRL_TU16BTMRL0_POSITION            equ 0000h
TU16BTMRL_TU16BTMRL0_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL0_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL0_MASK                equ 0001h
TU16BTMRL_TU16BTMRL1_POSN                equ 0001h
TU16BTMRL_TU16BTMRL1_POSITION            equ 0001h
TU16BTMRL_TU16BTMRL1_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL1_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL1_MASK                equ 0002h
TU16BTMRL_TU16BTMRL2_POSN                equ 0002h
TU16BTMRL_TU16BTMRL2_POSITION            equ 0002h
TU16BTMRL_TU16BTMRL2_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL2_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL2_MASK                equ 0004h
TU16BTMRL_TU16BTMRL3_POSN                equ 0003h
TU16BTMRL_TU16BTMRL3_POSITION            equ 0003h
TU16BTMRL_TU16BTMRL3_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL3_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL3_MASK                equ 0008h
TU16BTMRL_TU16BTMRL4_POSN                equ 0004h
TU16BTMRL_TU16BTMRL4_POSITION            equ 0004h
TU16BTMRL_TU16BTMRL4_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL4_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL4_MASK                equ 0010h
TU16BTMRL_TU16BTMRL5_POSN                equ 0005h
TU16BTMRL_TU16BTMRL5_POSITION            equ 0005h
TU16BTMRL_TU16BTMRL5_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL5_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL5_MASK                equ 0020h
TU16BTMRL_TU16BTMRL6_POSN                equ 0006h
TU16BTMRL_TU16BTMRL6_POSITION            equ 0006h
TU16BTMRL_TU16BTMRL6_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL6_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL6_MASK                equ 0040h
TU16BTMRL_TU16BTMRL7_POSN                equ 0007h
TU16BTMRL_TU16BTMRL7_POSITION            equ 0007h
TU16BTMRL_TU16BTMRL7_SIZE                equ 0001h
TU16BTMRL_TU16BTMRL7_LENGTH              equ 0001h
TU16BTMRL_TU16BTMRL7_MASK                equ 0080h
TU16BTMRL_TU16BTMR0_POSN                 equ 0000h
TU16BTMRL_TU16BTMR0_POSITION             equ 0000h
TU16BTMRL_TU16BTMR0_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR0_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR0_MASK                 equ 0001h
TU16BTMRL_TU16BTMR1_POSN                 equ 0001h
TU16BTMRL_TU16BTMR1_POSITION             equ 0001h
TU16BTMRL_TU16BTMR1_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR1_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR1_MASK                 equ 0002h
TU16BTMRL_TU16BTMR2_POSN                 equ 0002h
TU16BTMRL_TU16BTMR2_POSITION             equ 0002h
TU16BTMRL_TU16BTMR2_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR2_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR2_MASK                 equ 0004h
TU16BTMRL_TU16BTMR3_POSN                 equ 0003h
TU16BTMRL_TU16BTMR3_POSITION             equ 0003h
TU16BTMRL_TU16BTMR3_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR3_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR3_MASK                 equ 0008h
TU16BTMRL_TU16BTMR4_POSN                 equ 0004h
TU16BTMRL_TU16BTMR4_POSITION             equ 0004h
TU16BTMRL_TU16BTMR4_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR4_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR4_MASK                 equ 0010h
TU16BTMRL_TU16BTMR5_POSN                 equ 0005h
TU16BTMRL_TU16BTMR5_POSITION             equ 0005h
TU16BTMRL_TU16BTMR5_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR5_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR5_MASK                 equ 0020h
TU16BTMRL_TU16BTMR6_POSN                 equ 0006h
TU16BTMRL_TU16BTMR6_POSITION             equ 0006h
TU16BTMRL_TU16BTMR6_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR6_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR6_MASK                 equ 0040h
TU16BTMRL_TU16BTMR7_POSN                 equ 0007h
TU16BTMRL_TU16BTMR7_POSITION             equ 0007h
TU16BTMRL_TU16BTMR7_SIZE                 equ 0001h
TU16BTMRL_TU16BTMR7_LENGTH               equ 0001h
TU16BTMRL_TU16BTMR7_MASK                 equ 0080h

